ГТС/УТГТС/Documents/ИнойДокументПодтвержденияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнойДокументПодтвержденияНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПоНДС</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировкаЖурналаСФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Documents/СчетФактураПолученный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СчетФактураПолученный</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПриобретениеУслугПрочихАктивов</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ВыкупВозвратнойТарыУПоставщика</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.ВыкупПринятыхНаХранениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПоНДС</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученВЭлектронномВиде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтнестиКПредыдущемуОтчетномуКварталу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиКнигиПокупок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленКомиссионеромОтИмениПродавца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйКомиссионный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперацииНаУменьшение</Name>
					<Comment>Код вида операции при уменьшении стоимости (количества)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйКорректировочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировкаЖурналаСФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировкаСуммДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиКнигиПродаж</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураПолученный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХозяйственнаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУвеличение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУменьшение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУвеличение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУменьшение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУвеличениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУменьшениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУвеличениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУменьшениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятоКВычетуНДСДоВводаОстатков</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСДоВводаОстатков</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продавцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПродавца</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПППродавца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Documents/ИнойДокументПодтвержденияНДС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
	 И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьДублиСчетФактуры(Отказ);
		Если РучнаяКорректировкаЖурналаСФ И Не Отказ Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Движения документа %1 по журналу СФ отредактированы вручную и не могут быть автоматически актуализированы'"), Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка);
		КонецЕсли;
	КонецЕсли;
		
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		РучнаяКорректировкаЖурналаСФ = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	Если НЕ Отказ Тогда
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Ссылка);
		УчетНДСУП.СформироватьЗаданияПоДокументам(МассивДокументов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если РучнаяКорректировкаЖурналаСФ Тогда
		ДополнительныеСвойства.Вставить("РучнаяКорректировкаЖурналаСФ");
	КонецЕсли;

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОбщегоНазначенияУТ.ОчиститьИдентификаторыДокумента(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Бронирование") Тогда
		Реквизиты = Новый Структура("Контрагент, Организация", "КонтрагентПеревозчик");
	Иначе
		Реквизиты = Новый Структура("Контрагент, Организация, Дата");
	КонецЕсли;
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, Реквизиты);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования);
	
	Если ДанныеЗаполнения.Свойство("НаименованиеДокумента") Тогда
		НаименованиеДокумента = ДанныеЗаполнения.НаименованиеДокумента;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("НомерСФ") Тогда
		НомерВходящегоДокумента = ДанныеЗаполнения.НомерСФ;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ДатаСоставления") Тогда
		ДатаВходящегоДокумента = ДанныеЗаполнения.ДатаСоставления;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("Организация") Тогда
		Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("КодВидаОперации") Тогда
		КодВидаОперации = "23";
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("НаименованиеДокумента") Тогда
		НаименованиеДокумента = "Билет";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ПроверитьДублиСчетФактуры(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОснований.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК ТаблицаОснований
	|ГДЕ
	|	ТаблицаОснований.ДокументОснование = &ДокументОснование
	|	И ТаблицаОснований.Ссылка.Проведен
	|	И (ТаблицаОснований.Ссылка.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (НЕ ТаблицаОснований.Ссылка.Исправление)
	|	И (НЕ ТаблицаОснований.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнойДокументПодтвержденияНДС.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ИнойДокументПодтвержденияНДС КАК ИнойДокументПодтвержденияНДС
	|ГДЕ
	|	ИнойДокументПодтвержденияНДС.Ссылка <> &Ссылка
	|	И ИнойДокументПодтвержденияНДС.ДокументОснование = &ДокументОснование
	|	И ИнойДокументПодтвержденияНДС.Проведен
	|	И (ИнойДокументПодтвержденияНДС.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 по организации %2 уже введен документ подтверждения НДС'"),
			ДокументОснование,
			Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			"ДокументыОснования",
			,
			Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
